app/controllers/api/v1/nodes_controller.rb

      def classes_at_depth
        class_list = Node.to_depth(params[:ancestry_depth]).where(category: "class")
---
SELECT "nodes".* FROM "nodes" WHERE (ancestry_depth <= 1) AND "nodes"."category" = $1  [["category", "class"]]

      def path_to_root
        class_path = Node.find(params[:id]).ancestor_ids
---
SELECT "nodes".* FROM "nodes" WHERE "nodes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

      def show_doc
        node = Node.find(params[:id])
---
SELECT "nodes".* FROM "nodes" WHERE "nodes"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]